{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "output_shape_type": "raw", "batch_input_shape": [null, 66, 200, 3], "function_type": "lambda", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\n\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [66, 200, 3], "trainable": true, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 24, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "name": "conv0", "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "bias": true, "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 36, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "name": "conv1", "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "bias": true, "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 48, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "name": "conv2", "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "nb_col": 5, "b_regularizer": null, "bias": true, "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 64, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "name": "conv3", "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "bias": true, "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"trainable": true, "nb_filter": 64, "activity_regularizer": null, "W_constraint": null, "border_mode": "valid", "name": "conv4", "activation": "elu", "init": "glorot_uniform", "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "bias": true, "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": 1152, "activity_regularizer": null, "name": "fc0", "activation": "elu", "init": "glorot_uniform", "output_dim": 1024, "W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": 1024, "activity_regularizer": null, "name": "fc1", "activation": "elu", "init": "glorot_uniform", "output_dim": 512, "W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": 512, "activity_regularizer": null, "name": "fc3", "activation": "elu", "init": "glorot_uniform", "output_dim": 10, "W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "name": "dropout_5", "trainable": true}}, {"class_name": "Dense", "config": {"trainable": true, "input_dim": 10, "activity_regularizer": null, "name": "fc4", "activation": "linear", "init": "glorot_uniform", "output_dim": 1, "W_regularizer": null, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null}}]}